In [2]:
import pandas as pd

In [7]:
# Load essential IMDb files
title_basics = pd.read_csv('../data/title.basics.tsv', sep='\t', na_values='\\N')
title_ratings = pd.read_csv('../data/title.ratings.tsv', sep='\t', na_values='\\N')
name_basics = pd.read_csv('../data/name.basics.tsv', sep='\t', na_values='\\N')

C:\Users\askar\AppData\Local\Temp\ipykernel_18392\13587132.py:2: DtypeWarning: Columns (7) have mixed types. Specify dtype option on import or set low_memory=False.
  title_basics = pd.read_csv('../data/title.basics.tsv', sep='\t', na_values='\\N')

In [14]:
title_principals = pd.read_csv('../data/title.principals.tsv', sep='\t', na_values='\\N')

In [16]:
title_basics.info()
title_principals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11223196 entries, 0 to 11223195
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         float64
 5   startYear       float64
 6   endYear         float64
 7   runtimeMinutes  object
 8   genres          object
dtypes: float64(3), object(6)
memory usage: 770.6+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89005367 entries, 0 to 89005366
Data columns (total 6 columns):
 #   Column      Dtype
---  ------      -----
 0   tconst      object
 1   ordering    int64
 2   nconst      object
 3   category    object
 4   job         object
 5   characters  object
dtypes: int64(1), object(5)
memory usage: 4.0+ GB

In [18]:
title_ratings.info()
name_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1496265 entries, 0 to 1496264
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1496265 non-null  object
 1   averageRating  1496265 non-null  float64
 2   numVotes       1496265 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 34.2+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13933215 entries, 0 to 13933214
Data columns (total 6 columns):
 #   Column             Dtype
---  ------             -----
 0   nconst             object
 1   primaryName        object
 2   birthYear          float64
 3   deathYear          float64
 4   primaryProfession  object
 5   knownForTitles     object
dtypes: float64(2), object(4)
memory usage: 637.8+ MB

In [ ]:
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0.0,1894.0,NaN,1.0,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0.0,1892.0,NaN,5.0,"Animation,Short"
2,tt0000003,short,Poor Pierrot,Pauvre Pierrot,0.0,1892.0,NaN,5.0,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0.0,1892.0,NaN,12.0,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0.0,1893.0,NaN,1.0,"Comedy,Short"

In [ ]:
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2097
1  tt0000002            5.6       282
2  tt0000003            6.5      2117
3  tt0000004            5.4       182
4  tt0000005            6.2      2847

In [8]:
name_basics.head()

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899.0,1987.0,"actor,miscellaneous,producer","tt0050419,tt0072308,tt0053137,tt0027125"
1,nm0000002,Lauren Bacall,1924.0,2014.0,"actress,soundtrack,archive_footage","tt0037382,tt0075213,tt0117057,tt0038355"
2,nm0000003,Brigitte Bardot,1934.0,NaN,"actress,music_department,producer","tt0057345,tt0049189,tt0056404,tt0054452"
3,nm0000004,John Belushi,1949.0,1982.0,"actor,writer,music_department","tt0072562,tt0077975,tt0080455,tt0078723"
4,nm0000005,Ingmar Bergman,1918.0,2007.0,"writer,director,actor","tt0050986,tt0069467,tt0083922,tt0050976"

In [19]:
title_principals.head()

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,NaN,"[""Self""]"
1,tt0000001,2,nm0005690,director,NaN,NaN
2,tt0000001,3,nm0005690,producer,producer,NaN
3,tt0000001,4,nm0374658,cinematographer,director of photography,NaN
4,tt0000002,1,nm0721526,director,NaN,NaN

In [21]:
title_basics = title_basics.dropna(subset=['primaryTitle', 'genres'])

In [22]:
title_ratings = title_ratings.dropna(subset=['averageRating', 'numVotes'])

In [23]:
title_principals = title_principals.dropna(subset=['category'])